glcloud/keil_v5/ARM/PACK/.Web/NXP.MK12D5_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <vendor>NXP</vendor>
  <name>MK12D5_DFP</name>
  <description>Device Family Pack for MK12D5</description>
  <license>Licenses.txt</license>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <releases>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Device Startup</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK12D5" Dvendor="NXP:11">
      <description>The Kinetis(r) K12 50 MHz family of baseline MCUs targets cost-sensitive applications requiring low power and processing efficiency.

- Includes robust analog, communication, control and timing peripherals- 
- Provides upgrade from mechanical to touch keypad, rotary and slider interfaces- 
- Operates in all low-power modes with minimal current added- 
- Supports multiple communication interfaces for efficient data exchange, industrial network bridging and audio system interfacing- 
- Reduces overall system cost by eliminating the need for external voltage reference- 
- Secures data transfer and storage- 
- Shares the Kinetis portfolio's scalability and comprehensive development support- 
&amp;lt;/ul&amp;gt;</description>
      <device Dname="MK12DN512xxx5">
        <processor Dcore="Cortex-M4" Dfpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK12DN512xxx5_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff8000" size="0x8000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x8000"/>
        <algorithm name="arm/MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000" default="1"/>
        <debug svd="MK12D5.xml"/>
        <variant Dvariant="MK12DN512VLH5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DN512VLH5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DN512VLH5/MK12DN512xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK12DN512VLK5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DN512VLK5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DN512VLK5/MK12DN512xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK12DN512VMC5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DN512VMC5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DN512VMC5/MK12DN512xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK12DX128xxx5">
        <processor Dcore="Cortex-M4" Dfpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK12DX128xxx5_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" access="rx" start="0x10000000" size="0x010000"/>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x020000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fffc000" size="0x4000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x4000"/>
        <algorithm name="arm/MK_D64_50MHZ.FLM" start="0x10000000" size="0x00010000" default="1"/>
        <algorithm name="arm/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000" default="1"/>
        <debug svd="MK12D5.xml"/>
        <variant Dvariant="MK12DX128VLF5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DX128VLF5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DX128VLF5/MK12DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK12DX128VLH5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DX128VLH5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DX128VLH5/MK12DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK12DX128VLK5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DX128VLK5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DX128VLK5/MK12DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK12DX128VMC5">
          <compile header="fsl_device_registers.h" define="CPU_MK12DX128VMC5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK12DX128VMC5/MK12DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
