glcloud/keil_v5/ARM/PACK/.Web/NXP.MK12D5_DFP.pdsc
    <condition id="devices.MK12DX128xxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK12DX128???5"/>
    </condition>
    <condition id="devices.MK12DX256xxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK12DX256???5"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MK12D5_platform.Include_core_cm4">
      <description></description>
      <files>
        <file name="arm/startup_MK12D5.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MK12D5.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MK12D5.h" category="header" attr="config"/>
        <file name="MK12D5_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MK12DN512xxx5_flash.scf" category="linkerScript" condition="devices.MK12DN512xxx5_mdk" attr="config"/>
        <file name="arm/MK12DN512xxx5_ram.scf" category="linkerScript" condition="devices.MK12DN512xxx5_mdk" attr="config"/>
        <file name="arm/MK12DX128xxx5_flash.scf" category="linkerScript" condition="devices.MK12DX128xxx5_mdk" attr="config"/>
        <file name="arm/MK12DX128xxx5_ram.scf" category="linkerScript" condition="devices.MK12DX128xxx5_mdk" attr="config"/>
        <file name="arm/MK12DX256xxx5_flash.scf" category="linkerScript" condition="devices.MK12DX256xxx5_mdk" attr="config"/>
        <file name="arm/MK12DX256xxx5_ram.scf" category="linkerScript" condition="devices.MK12DX256xxx5_mdk" attr="config"/>
        <file name="iar/MK12DN512xxx5_flash.icf" category="linkerScript" condition="devices.MK12DN512xxx5_iar" attr="config"/>
        <file name="iar/MK12DN512xxx5_ram.icf" category="linkerScript" condition="devices.MK12DN512xxx5_iar" attr="config"/>
        <file name="iar/MK12DX128xxx5_flash.icf" category="linkerScript" condition="devices.MK12DX128xxx5_iar" attr="config"/>
        <file name="iar/MK12DX128xxx5_ram.icf" category="linkerScript" condition="devices.MK12DX128xxx5_iar" attr="config"/>
        <file name="iar/MK12DX256xxx5_flash.icf" category="linkerScript" condition="devices.MK12DX256xxx5_iar" attr="config"/>
        <file name="iar/MK12DX256xxx5_ram.icf" category="linkerScript" condition="devices.MK12DX256xxx5_iar" attr="config"/>
        <file name="system_MK12D5.c" category="sourceC" attr="config"/>
        <file name="system_MK12D5.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MK12D5" isDefaultVariant="1" condition="devices.MK12D5_device.MK12D5_device.MK12D5_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="dspi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MK12D5_driver.dspi">
      <description>DSPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_dspi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_dspi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.1" Csub="i2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MK12D5_driver.i2c">
      <description>I2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_i2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_i2c_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="uart_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MK12D5_driver.uart">
      <description>UART CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_uart_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_uart_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="adc" condition="device.MK12D5_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file name="drivers/fsl_adc16.c" category="sourceC"/>
        <file name="drivers/fsl_adc16.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="clock" condition="device.MK12D5_driver.common">
      <description>Clock Driver</description>
      <files>
        <file name="drivers/fsl_clock.c" category="sourceC"/>
        <file name="drivers/fsl_clock.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="cmp" condition="device.MK12D5_driver.common">
      <description>CMP Driver</description>
      <files>
        <file name="drivers/fsl_cmp.c" category="sourceC"/>
        <file name="drivers/fsl_cmp.h" category="header"/>
      </files>
    </component>
